In [4]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable

ERROR: Could not find a version that satisfies the requirement pandasdd (from versions: none)
ERROR: No matching distribution found for pandasdd

[notice] A new release of pip is available: 23.2.1 -> 24.3.1
[notice] To update, run: C:\Program Files\Python312\python.exe -m pip install --upgrade pip

In [8]:
# Series
# A Pandas Series is a one dimensional array-like object that can hold any data type.
import pandas as pd

data = [1,2,3,4,5]
Series = pd.Series(data) # Series is a inbuilt function
print('Series: \n', Series)
print(type(Series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
# Create Series from Dictionary
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

# key becomes index

a    1
b    2
c    3
dtype: int64

In [10]:
# So this way  we also can create a series
data = [1,2,3,4,5]
index = ['a','b','c','d','e']
pd.Series(data,index=index)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [2]:
# In Series it just has a single column and 
# In DataFrame, we have multiple rows and columns.

In [13]:
# Dataframe
# Create a Dataframe from a dictionary of a list
data = {
    'Name':['krish','john','jack'],
    'Age':[25,36,42],
    'City':['Bangalore','New York','Florida']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  krish   25  Bangalore
1   john   36   New York
2   jack   42    Florida
<class 'pandas.core.frame.DataFrame'>

In [17]:
# Instead of writing like above cell
# We can write like below code:
data = [{'Name':'krish','Age':25,'City':'Bangalore'},
        {'Name':'john','Age':34,'City':'Bangalore'},
        {'Name':'jack','Age':42,'City':'Bangalore'},
        {'Name':'keshav','Age':25,'City':'New Delhi'}]

# What is this?
# This is a list of dictionary key value pairs
df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0   krish   25  Bangalore
1    john   34  Bangalore
2    jack   42  Bangalore
3  keshav   25  New Delhi
<class 'pandas.core.frame.DataFrame'>

In [19]:
df

     Name  Age       City
0   krish   25  Bangalore
1    john   34  Bangalore
2    jack   42  Bangalore
3  keshav   25  New Delhi

In [24]:
s= df['Name']
type(s)

# If I'm picking one column, then it will become a series

pandas.core.series.Series

In [25]:
df.loc[0]
# loc basically means row index

Name        krish
Age            25
City    Bangalore
Name: 0, dtype: object

In [27]:
df.iloc[0][2]
# index location 
# column index

C:\Users\soodk\AppData\Local\Temp\ipykernel_18844\2843509357.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Bangalore'

In [29]:
df

     Name  Age       City
0   krish   25  Bangalore
1    john   34  Bangalore
2    jack   42  Bangalore
3  keshav   25  New Delhi

In [28]:
# Accessing a specified element
df.at[2,'Name']

'jack'

In [30]:
df.at[1,'Age']

np.int64(34)

In [32]:
# Accessing a specified element using iat
df.iat[2,2]

'Bangalore'

In [37]:
# Adding a column
df['Salary'] = [40000,50000,60000,70000]
df

     Name  Age       City  Salary
0   krish   25  Bangalore   40000
1    john   34  Bangalore   50000
2    jack   42  Bangalore   60000
3  keshav   25  New Delhi   70000

In [39]:
# Remove a column 
df.drop('Salary',axis=1) # (Temporary drop)
# axis =0 means checking in row index (default index)
# axis =1 means checking in column index

     Name  Age       City
0   krish   25  Bangalore
1    john   34  Bangalore
2    jack   42  Bangalore
3  keshav   25  New Delhi

In [40]:
df

     Name  Age       City  Salary
0   krish   25  Bangalore   40000
1    john   34  Bangalore   50000
2    jack   42  Bangalore   60000
3  keshav   25  New Delhi   70000

In [42]:
# Remove column permanently using inplace parameter

df.drop('Salary',axis=1,inplace=True)#(Permanent drop)

In [43]:
df

     Name  Age       City
0   krish   25  Bangalore
1    john   34  Bangalore
2    jack   42  Bangalore
3  keshav   25  New Delhi

In [45]:
# Add 1 age to the column
df['Age']= df['Age']+2
df
# It is got incremented by 1

     Name  Age       City
0   krish   27  Bangalore
1    john   36  Bangalore
2    jack   44  Bangalore
3  keshav   27  New Delhi

In [46]:
df.drop(0)

     Name  Age       City
1    john   36  Bangalore
2    jack   44  Bangalore
3  keshav   27  New Delhi